Ծրագրի կոդի մեջ մեծ թվերն ավելի ընթեռնելի դարձնելու նպատակով **_JavaScript_** ծրագրավորման լեզվում ստեղծվել է նոր հնարավորություն, որը թույլ է տալիս կիրառել թվային տարանջատիչներ։ Թվային տարանջատիչներն օգտագործվում են _Java, Python, Perl, Ruby, C#_ և մի շարք այլ ծրագրավորման լեզուներում, սակայն այն _JavaScript_-ում մշակվել է վերջերս, և ընդգրկվել է **ECMAScript 2021** ստանդարտում:

*JavaScrip*t-ում որպես թվային տարանջատիչ օգտագործվում է անդըրսքորը (_հայերեն մասնագիտական գրականության մեջ կարելի է հանդիպել underscore - ստորագիծ թարգմանությամբ_)։ Սա իհարկե կոսմետիկ բնույթի նորամուծություն է, և չի ազդում կոդի արտադրողականության վրա, սակայն զգալիորեն լավացնում է ընթեռնելիությունն ու իջեցնում սխալների հավանականությունը մեծ թվերի հետ աշխատելիս։ Օրինակ՝

const bigNumber1 = 1000000000000
const bigNumber2 = 1_000_000_000_000

bigNumber2-ը ակնհայտորեն ավելի հեշտ է կարդացվում, քան bigNumber1-ը, թեև նրանք ունեն բացարձակ նույն արժեքը։ Ի դեպ թվային տարանջատիչը կարող ենք կիրառել ոչ միայն ամբողջ թվերի հետ աշխատելիս։ Օրինակ π թվի համեմատաբար ավելի բարձր ճշգրտության արժեքը կարելի գրառել հետևյալ կերպ՝

```
const PI = 3.1415_9265_3589
```

Նկատենք, որ թվանշանի սկզբում կամ վերջում տարանջատիչի օգտագործումը սխալ է:

```
const bad_number1 = _1000_000_000 // ReferenceError
const bad_number2 = 5.1512_4578_ // SyntaxError
```

Թվային տարանջատիչների օգտագործման հնարավորությունը ներկայումս աջակցվում է բոլոր ժամանակակից դիտարկիչների կողմից։ [](https://github.com/tc39/proposal-numeric-separator?fbclid=IwAR3JJ_-V6xKq0ty6iqjOXhW0MJgN7heNP6zAhRfcNCuv15u4iZ48_69txHk)
կարող եք ծանոթանալ թվային տարանջատիչների կիրառման տարբեր օրինակների, այդ թվում նաև թվերի երկուական, ութական և տասնվեցական հաշվարկման համակարգերում։
